---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Infrastructure.AlignmentStationLabel
source: html/c1e852d4-7674-3c96-1330-c4feb39a3a72.htm
---
# AlignmentStationLabel Members

Creates an AlignmentStationLabel object along with its underlying SpotDimension element.
 Returns null if element creation fails.